var menu = [
    {
        "name": "农林牧渔大类",
        "code": "61",
        "child": [
            {
                "name": "农业类",
                "code": "6101"
            },
            {
                "name": "林业类",
                "code": "6102"
            },
            {
                "name": "畜牧业类",
                "code": "6103"
            },
            {
                "name": "渔业类",
                "code": "6104"
            }
        ]
    },
    {
        "name": "资源环境与安全大类",
        "code": "62",
        "child": [
            {
                "name": "资源勘查类",
                "code": "6201"
            },
            {
                "name": "地质类",
                "code": "6202"
            },
            {
                "name": "测绘地理信息类",
                "code": "6203"
            },
            {
                "name": "石油与天然气类",
                "code": "6204"
            },
            {
                "name": "煤炭类",
                "code": "6205"
            },
            {
                "name": "金属与非金属矿类",
                "code": "6206"
            },
            {
                "name": "气象类",
                "code": "6207"
            },
            {
                "name": "环境保护类",
                "code": "6208"
            },
            {
                "name": "安全类",
                "code": "6209"
            }
        ]
    },
    {
        "name": "能源动力与材料大类",
        "code": "63",
        "child": [
            {
                "name": "电力技术类",
                "code": "6301"
            },
            {
                "name": "热能与发电工程类",
                "code": "6302"
            },
            {
                "name": "新能源发电工程类",
                "code": "6303"
            },
            {
                "name": "黑色金属材料类",
                "code": "6304"
            },
            {
                "name": "有色金属材料类",
                "code": "6305"
            },
            {
                "name": "建筑材料类",
                "code": "6307"
            }
        ]
    },
    {
        "name": "土木建筑大类",
        "code": "64",
        "child": [
            {
                "name": "建筑设计类",
                "code": "6401"
            },
            {
                "name": "城乡规划与管理类",
                "code": "6402"
            },
            {
                "name": "土建施工类",
                "code": "6403"
            },
            {
                "name": "建筑设备类",
                "code": "6404"
            },
            {
                "name": "建设工程管理类",
                "code": "6405"
            },
            {
                "name": "市政工程类",
                "code": "6406"
            },
            {
                "name": "房地产类",
                "code": "6407"
            }
        ]
    },
    {
        "name": "水利大类",
        "code": "65",
        "child": [
            {
                "name": "水文水资源类",
                "code": "6501"
            },
            {
                "name": "水利工程与管理类",
                "code": "6502"
            },
            {
                "name": "水利水电设备类",
                "code": "6503"
            },
            {
                "name": "水土保持与水环境类",
                "code": "6504"
            }
        ]
    },
    {
        "name": "装备制造大类",
        "code": "66",
        "child": [
            {
                "name": "机械设计制造类",
                "code": "6601"
            },
            {
                "name": "机电设备类",
                "code": "6602"
            },
            {
                "name": "自动化类",
                "code": "6603"
            },
            {
                "name": "船舶与海洋工程装备类",
                "code": "6605"
            },
            {
                "name": "航空装备类",
                "code": "6606"
            },
            {
                "name": "汽车制造类",
                "code": "6607"
            }
        ]
    },
    {
        "name": "生物与化工大类",
        "code": "67",
        "child": [
            {
                "name": "生物技术类",
                "code": "6701"
            },
            {
                "name": "化工技术类",
                "code": "6702"
            }
        ]
    },
    {
        "name": "轻工纺织大类",
        "code": "68",
        "child": [
            {
                "name": "轻化工类",
                "code": "6801"
            },
            {
                "name": "包装类",
                "code": "6802"
            },
            {
                "name": "印刷类",
                "code": "6803"
            },
            {
                "name": "纺织服装类",
                "code": "6804"
            }
        ]
    },
    {
        "name": "食品药品与粮食大类",
        "code": "69",
        "child": [
            {
                "name": "食品类",
                "code": "6901"
            },
            {
                "name": "药品与医疗器械类",
                "code": "6902"
            },
            {
                "name": "粮食类",
                "code": "6903"
            }
        ]
    },
    {
        "name": "交通运输大类",
        "code": "70",
        "child": [
            {
                "name": "铁道运输类",
                "code": "7001"
            },
            {
                "name": "道路运输类",
                "code": "7002"
            },
            {
                "name": "水上运输类",
                "code": "7003"
            },
            {
                "name": "航空运输类",
                "code": "7004"
            },
            {
                "name": "城市轨道交通类",
                "code": "7006"
            },
            {
                "name": "邮政类",
                "code": "7007"
            }
        ]
    },
    {
        "name": "电子与信息大类",
        "code": "71",
        "child": [
            {
                "name": "电子信息类",
                "code": "7101"
            },
            {
                "name": "计算机类",
                "code": "7102"
            },
            {
                "name": "通信类",
                "code": "7103"
            },
            {
                "name": "集成电路类",
                "code": "7104"
            }
        ]
    },
    {
        "name": "医药卫生大类",
        "code": "72",
        "child": [
            {
                "name": "护理类",
                "code": "7202"
            },
            {
                "name": "药学类",
                "code": "7203"
            },
            {
                "name": "中医药类",
                "code": "7204"
            },
            {
                "name": "医学技术类",
                "code": "7205"
            },
            {
                "name": "康复治疗类",
                "code": "7206"
            },
            {
                "name": "公共卫生与卫生管理类",
                "code": "7207"
            },
            {
                "name": "健康管理与促进类",
                "code": "7208"
            },
            {
                "name": "眼视光类",
                "code": "7209"
            }
        ]
    },
    {
        "name": "财经商贸大类",
        "code": "73",
        "child": [
            {
                "name": "财政税务类",
                "code": "7301"
            },
            {
                "name": "金融类",
                "code": "7302"
            },
            {
                "name": "财务会计类",
                "code": "7303"
            },
            {
                "name": "统计类",
                "code": "7304"
            },
            {
                "name": "经济贸易类",
                "code": "7305"
            },
            {
                "name": "工商管理类",
                "code": "7306"
            },
            {
                "name": "电子商务类",
                "code": "7307"
            },
            {
                "name": "物流类",
                "code": "7308"
            }
        ]
    },
    {
        "name": "旅游大类",
        "code": "74",
        "child": [
            {
                "name": "旅游类",
                "code": "7401"
            },
            {
                "name": "餐饮类",
                "code": "7402"
            }
        ]
    },
    {
        "name": "文化艺术大类",
        "code": "75",
        "child": [
            {
                "name": "艺术设计类",
                "code": "7501"
            },
            {
                "name": "表演艺术类",
                "code": "7502"
            },
            {
                "name": "民族文化艺术类",
                "code": "7503"
            },
            {
                "name": "文化服务类",
                "code": "7504"
            }
        ]
    },
    {
        "name": "新闻传播大类",
        "code": "76",
        "child": [
            {
                "name": "新闻出版类",
                "code": "7601"
            },
            {
                "name": "广播影视类",
                "code": "7602"
            }
        ]
    },
    {
        "name": "教育与体育大类",
        "code": "77",
        "child": [
            {
                "name": "教育类",
                "code": "7701"
            },
            {
                "name": "语言类",
                "code": "7702"
            },
            {
                "name": "体育类",
                "code": "7703"
            }
        ]
    },
    {
        "name": "公安与司法大类",
        "code": "78",
        "child": [
            {
                "name": "法律实务类",
                "code": "7804"
            },
            {
                "name": "安全防范类",
                "code": "7807"
            }
        ]
    },
    {
        "name": "公共管理与服务大类",
        "code": "79",
        "child": [
            {
                "name": "公共事业类",
                "code": "7901"
            },
            {
                "name": "公共管理类",
                "code": "7902"
            },
            {
                "name": "公共服务类",
                "code": "7903"
            },
            {
                "name": "文秘类",
                "code": "7904"
            }
        ]
    }
]